{"id": "samsum-13729889", "input": "Yannick: I heard you are going to sing the anthem\r\nYannick: At the game\r\nNicki: Yes I am \r\nNicki: I am nervous! \r\nYannick: Dont be\r\nYannick: It's a huge privilege to sing the anthem in front of thousands of people!\r\nNicki: I hoep I won't forget the lyrics\r\nNicki: hope* \r\nYannick: Youre a great singer\r\nYannick: You will be fine \r\nNicki: I have to rehearse \r\nYannick: Your parents coming with you?\r\nNicki: Yes\r\nYannick: They're probably proud of you good luck! \r\nNicki: Thank you Yannick", "output": "Nicki is going to sing the anthem at the game.", "type": "samsum"}
{"id": "mediasum-abs-NPR-48", "input": "Interview title: Monthly Song Project Gives The Raveonettes Freedom Of 'A Blank Slate'\nInterview dialogue: \nRACHEL MARTIN, HOST: The Raveonettes are a Danish rock duo, and they're doing things a little unconventionally this year. Rather than releasing an entire album all at once, they're releasing one song on the last Friday of each month. And they're calling the project Rave of the Month.\nTHE RAVEONETTES: (Singing) This world is empty without you. Tonight, tonight, tonight.\nRACHEL MARTIN, HOST: The Raveonettes are made up of Sune Rose Wagner and Sharin Foo, and they join me now from our studios at NPR West. Hey, you too. Welcome to the program.\nSUNE ROSE WAGNER: Thank you.\nSHARIN FOO: Hi. Thanks.\nRACHEL MARTIN, HOST: The song we're hearing right now is called \"The World Is Empty (Without You).\" This was the first song you released for the project. This is back in January of this year. Are these things that are just kind of coming up organically in that month? Are you setting strict writing parameters? Are there things you've had on the shelf for a while?\nSUNE ROSE WAGNER: I'm not the best at having too much time to work on things, so...\nRACHEL MARTIN, HOST: ...You need a deadline, Sune?\nSUNE ROSE WAGNER: Yeah, I need a deadline, so I usually wait.\nRACHEL MARTIN, HOST: Sharin, how do you feel about that, Sune's procrastination?\nSHARIN FOO: Yeah, this is an ongoing discussion in the band because, you know, I get a track, you know, five hours before it has to be delivered, which, you know - but I suppose I've gotten used to it. And this has become a very Raveonettes way of working, which is sort of spur-of-the-moment, very stream-of-consciousness way. And I sort of hate it and like it.\nRACHEL MARTIN, HOST: You sound resigned. Although I imagine there is a kind of freedom to that. You don't have to overthink things.\nSHARIN FOO: Yeah.\nSUNE ROSE WAGNER: Well, it's - the whole idea is that it's hard to make decisions sometimes. You know, it's like when you go to a restaurant and they have, you know, 10 pastas that sound really good but you just wait till the waiter gets there and you just pick one. And it's kind of like the same thing.\nRACHEL MARTIN, HOST: I get that, the paralysis of too many choices, totally.\nSUNE ROSE WAGNER: Yeah.\nSHARIN FOO: But there is a wonderful freedom in this project, which is that nothing has to be cohesive. And it's really like a blank slate.\nSUNE ROSE WAGNER: Yeah.\nSHARIN FOO: And that's actually been a very positive experience for the both of us.\nTHE RAVEONETTES: (Singing) So I know that you've been cheating with my friend. Prepare to die. Prepare for war.\nRACHEL MARTIN, HOST: This is the fourth one that was released from the month of April. It's called \"Junko Ozawa.\" So who was this person? Who was Junko Ozawa?\nSUNE ROSE WAGNER: Well, she was a very famous videogame composer in the '80s kind of thing. So the most famous one she did was \"Rolling Thunder,\" it's called.\nRACHEL MARTIN, HOST: \"Rolling Thunder\"?\nSUNE ROSE WAGNER: Yeah.\nRACHEL MARTIN, HOST: OK. I don't know if that was on my Atari. You know, I'd have to go look it up.\nSUNE ROSE WAGNER: It was. Trust me, it was, yeah.\nRACHEL MARTIN, HOST: Was it?\nRACHEL MARTIN, HOST: And you were just interested in that kind of techno throwback '80s videogame sound?\nSUNE ROSE WAGNER: It's a very harsh sound, obviously. But at the same time, I guess, when you grew up in the '80s like that, it's also a very nostalgic sound.\nRACHEL MARTIN, HOST: I'm going to play February's song, which is called \"Run Mascara Run.\" Before I play this, anything you want to say about this particular track?\nSUNE ROSE WAGNER: That's actually my favorite. That's all I'm going to say.\nTHE RAVEONETTES: (Singing) Seen you in my dreams of love and falling bombs. Young roses lie dead when the napalm smell is gone.\nRACHEL MARTIN, HOST: Interesting, napalm and doo-wop. Kind of...\nRACHEL MARTIN, HOST: ...Contradictory vibes on this.\nSHARIN FOO: Perfect cocktail.\nRACHEL MARTIN, HOST: Yeah. So you a fan of kind of 1950s doo-wop?\nSUNE ROSE WAGNER: Yes, I'm a big fan of 1950s doo-wop. I'm actually a really good friend of Dion from Dion and the Belmonts.\nRACHEL MARTIN, HOST: Are you?\nSUNE ROSE WAGNER: Yeah. He once took me back to his old neighborhood, Author Avenue in the Bronx, and showed me, you know, where he grew up and where they started, you know, the band. And we were surrounded by these crazy wannabe mobsters the whole day. He's treated like Frank Sinatra up there. They won't leave him alone, you know? The people are following us on the street. Every time we walk into a store, the guy gives us free Parmesan cheese.\nRACHEL MARTIN, HOST: (Laughter).\nSUNE ROSE WAGNER: And I came home with huge shopping bags of cheeses and sausages and everything Italian from - it was - yeah, it's pretty spectacular.\nRACHEL MARTIN, HOST: Are these things going to exist just in isolation in this one-off project, or do you imagine ever kind of putting them together and finding some kind of thread that you could sew them into an album?\nSUNE ROSE WAGNER: They will all released sort of like as a compilation album I guess next year or by the end of the year or...\nSHARIN FOO: ...Yes. But, you know, what's going to be great is we don't even have to think about the sequence because it's going to be January, February, March, April. And it'll be probably totally schizophrenic, but in a really wonderful way, you know?\nRACHEL MARTIN, HOST: Sune Rose Wagner and Sharin Foo are The Raveonettes. You can hear their month-by-month songs by going to theraveonettes.com. Hey, you guys, thanks so much for talking with us.\nSUNE ROSE WAGNER: Thank you for having us.\nSHARIN FOO: Thanks for having us.\nTHE RAVEONETTES: (Singing) Don't cry, just let me go.\n", "output": "Members of the Danish rock band, Sune Rose Wagner and Sharin Foo, say their unconvential launch strategy will result in an album that may be \"totally schizophrenic, but in a really wonderful way.\"", "type": "mediasum-abs"}
