{"id": "hotpotqa-5abd04f15542996e802b467e", "input": "Title: Robert Sheehan\nContent: Robert Michael Sheehan (Irish: \"Roibeárd Mícheál Ó Siodhacháin\" ; born 7 January 1988) is an Irish actor. He is best known for television roles such as Nathan Young in \"Misfits\" and Darren in \"Love/Hate\", as well as the 2009 film \"Cherrybomb\" alongside Rupert Grint. He also co-starred in the film \"Killing Bono\" as Ivan McCormick. In late 2011 he starred in John Crowley's production of J. M. Synge's comic play \"The Playboy of the Western World\" at the Old Vic Theatre in London.\n\nTitle: The Messenger (2015 horror film)\nContent: The Messenger is a 2015 British supernatural mystery horror film directed by David Blair, written by Andrew Kirk and starring Robert Sheehan and Lily Cole.\n\nQuestion: What male actor starred in The Messenger?", "output": "Robert Sheehan.\nEvidences:\nRobert Michael Sheehan (Irish: \"Roibeárd Mícheál Ó Siodhacháin\" ; born 7 January 1988) is an Irish actor.\nThe Messenger is a 2015 British supernatural mystery horror film directed by David Blair, written by Andrew Kirk and starring Robert Sheehan and Lily Cole.\n", "type": "hotpotqa"}
{"id": "hotpotqa-5a7d90195542991319bc93cf", "input": "Title: Pirna 014\nContent: The Pirna 014 was an axial turbojet designed in East Germany (or the GDR) in the mid- to late 1950s by former Junkers engineers, who were repatriated to East Germany in 1954 after being held in custody in the Soviet Union following World War II.\n\nTitle: Junkers\nContent: Junkers Flugzeug- und Motorenwerke AG (JFM, earlier JCO or JKO in World War I), more commonly Junkers, was a major German aircraft and aircraft engine manufacturer. It produced some of the world's most innovative and best-known airplanes over the course of its fifty-plus year history in Dessau, Germany. It was founded there in 1895 by Hugo Junkers, initially manufacturing boilers and radiators. During World War I, and following the war, the company became famous for its pioneering all-metal aircraft. During World War II the company produced some of the most successful Luftwaffe planes, as well as piston and jet aircraft engines, albeit in the absence of its founder, who had been removed by the Nazis in 1934.\n\nQuestion: The axial turbojet Pirna 014 was designed by engineers from this German aircraft and aircraft engine manufacturer based in which city?", "output": "Dessau.\nEvidences:\nThe Pirna 014 was an axial turbojet designed in East Germany (or the GDR) in the mid- to late 1950s by former Junkers engineers, who were repatriated to East Germany in 1954 after being held in custody in the Soviet Union following World War II.\nJunkers Flugzeug- und Motorenwerke AG (JFM, earlier JCO or JKO in World War I), more commonly Junkers, was a major German aircraft and aircraft engine manufacturer.\nIt produced some of the world's most innovative and best-known airplanes over the course of its fifty-plus year history in Dessau, Germany.\n", "type": "hotpotqa"}
